---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/richard/Desktop/ec970/RichardOuyang_project.log
  log type:  text
 opened on:  25 Mar 2017, 19:54:50

. 
. * do RichardOuyang_PUFclean.do

. 
. * do RichardOuyang_aggregateclean.do

. 
. * do RichardOuyang_PUFcombine.do

. 
. * do RichardOuyang_aggregatecombine.do

. 
. ***** AGGREGATE *****

. 
. use aggregate, clear

. 
. eststo clear

. 
. gen average_medicare_allowed_amt = total_medicare_allowed_amt / total_services

. label variable average_medicare_allowed_amt "Average Medicare allowed amount"

. 
. eststo: reg average_medicare_allowed_amt total_services total_unique_benes bene
> ficiary_average_age beneficiary_female_count beneficiary_average_risk_score i.n
> ppes_entity_code i.nppes_provider_gender i.nppes_provider_state i.year, r
note: 1.nppes_entity_code omitted because of collinearity

Linear regression                               Number of obs     =  2,400,166
                                                F(66, 2400099)    =    1637.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0876
                                                Root MSE          =     68.533

--------------------------------------------------------------------------------
               |               Robust
average_medi~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
total_services |  -.0006497   .0000427   -15.23   0.000    -.0007333   -.0005661
total_unique~s |  -.0032623   .0019258    -1.69   0.090    -.0070368    .0005121
beneficiary~ge |   .2332122   .0259913     8.97   0.000     .1822701    .2841542
be~emale_count |  -.0196804   .0018985   -10.37   0.000    -.0234014   -.0159594
beneficiary~re |   20.36953   .1322377   154.04   0.000     20.11035    20.62871
               |
nppes_entity~e |
            I  |          0  (omitted)
               |
nppes_provid~r |
            M  |   18.08784   .2976902    60.76   0.000     17.50438     18.6713
               |
nppes_provid~e |
           AE  |    -28.863    17.5336    -1.65   0.100    -63.22824    5.502244
           AK  |   1.832915   17.11059     0.11   0.915    -31.70324    35.36907
           AL  |  -27.78074   17.06171    -1.63   0.103    -61.22109    5.659615
           AP  |   7.514168   19.37631     0.39   0.698    -30.46273    45.49106
           AR  |  -25.03718   17.06518    -1.47   0.142    -58.48433    8.409974
           AS  |  -65.08551   19.99486    -3.26   0.001    -104.2747   -25.89628
           AZ  |  -20.41762   17.06349    -1.20   0.231    -53.86145    13.02622
           CA  |  -16.16584   17.06189    -0.95   0.343    -49.60655    17.27486
           CO  |  -18.60429   17.06507    -1.09   0.276    -52.05123    14.84265
           CT  |  -22.99241   17.06394    -1.35   0.178    -56.43714    10.45232
           DC  |  -7.362728   17.08683    -0.43   0.667    -40.85231    26.12686
           DE  |   -22.9953   17.06894    -1.35   0.178    -56.44982    10.45922
           FL  |  -14.91755   17.06028    -0.87   0.382    -48.35511       18.52
           GA  |  -25.53909   17.06096    -1.50   0.134    -58.97797    7.899788
           GU  |    -31.738   17.24682    -1.84   0.066    -65.54115    2.065158
           HI  |  -20.56503   17.07766    -1.20   0.229    -54.03665    12.90658
           IA  |  -33.05035   17.06384    -1.94   0.053    -66.49488    .3941812
           ID  |  -25.54074    17.0752    -1.50   0.135    -59.00753    7.926053
           IL  |  -20.93447     17.061    -1.23   0.220    -54.37343    12.50449
           IN  |  -27.41316   17.06123    -1.61   0.108    -60.85258    6.026251
           KS  |  -26.43925   17.06427    -1.55   0.121    -59.88462    7.006117
           KY  |   -30.6415   17.06183    -1.80   0.073    -64.08209    2.799086
           LA  |   -26.1145   17.07161    -1.53   0.126    -59.57425     7.34525
           MA  |   -21.1062   17.06166    -1.24   0.216    -54.54646    12.33405
           MD  |  -13.05795    17.0628    -0.77   0.444    -46.50044    20.38455
           ME  |   -27.3556   17.06683    -1.60   0.109    -60.80599    6.094795
           MI  |  -25.62953   17.06139    -1.50   0.133    -59.06926    7.810209
           MN  |  -30.74259   17.06771    -1.80   0.072     -64.1947    2.709517
           MO  |  -22.49649   17.06206    -1.32   0.187    -55.93753    10.94455
           MP  |  -40.67708   17.68871    -2.30   0.021    -75.34634   -6.007824
           MS  |  -31.28642    17.0632    -1.83   0.067     -64.7297    2.156859
           MT  |  -23.01382   17.07858    -1.35   0.178    -56.48725    10.45961
           NC  |  -27.67757   17.06032    -1.62   0.105     -61.1152     5.76007
           ND  |  -29.29908   17.07456    -1.72   0.086    -62.76463    4.166462
           NE  |  -32.08769   17.06667    -1.88   0.060    -65.53778    1.362387
           NH  |  -19.84597   17.06793    -1.16   0.245    -53.29852    13.60658
           NJ  |  -21.95981   17.06142    -1.29   0.198     -55.3996    11.47998
           NM  |  -26.03595   17.06842    -1.53   0.127    -59.48945    7.417552
           NV  |  -17.18742   17.06761    -1.01   0.314    -50.63933    16.26449
           NY  |  -21.90968   17.06238    -1.28   0.199    -55.35136    11.53199
           OH  |  -26.51332   17.06142    -1.55   0.120     -59.9531    6.926472
           OK  |  -27.67116   17.06344    -1.62   0.105     -61.1149    5.772575
           OR  |    -22.462    17.0709    -1.32   0.188    -55.92036    10.99637
           PA  |  -24.91728   17.06202    -1.46   0.144    -58.35824     8.52368
           PR  |  -43.43344   17.07661    -2.54   0.011    -76.90299   -9.963882
           RI  |   -23.0341   17.06903    -1.35   0.177     -56.4888    10.42061
           SC  |   -29.0238   17.06146    -1.70   0.089    -62.46366    4.416064
           SD  |  -31.91471     17.072    -1.87   0.062    -65.37522    1.545805
           TN  |  -28.39482   17.06118    -1.66   0.096    -61.83414    5.044499
           TX  |  -22.89758    17.0609    -1.34   0.180    -56.33635    10.54118
           UT  |  -18.61193   17.07268    -1.09   0.276    -52.07379    14.84993
           VA  |  -23.98923   17.06091    -1.41   0.160    -57.42801    9.449558
           VI  |  -15.67923    17.2323    -0.91   0.363    -49.45392    18.09547
           VT  |   -27.5249   17.08152    -1.61   0.107    -61.00408    5.954268
           WA  |  -22.24685   17.06514    -1.30   0.192    -55.69392    11.20022
           WI  |  -32.69951   17.06324    -1.92   0.055    -66.14286    .7438303
           WV  |  -28.46675   17.06419    -1.67   0.095    -61.91197    4.978466
           WY  |  -26.58891   17.08717    -1.56   0.120    -60.07918    6.901353
               |
          year |
         2013  |   1.492391   .1058407    14.10   0.000     1.284947    1.699835
         2014  |    3.79142   .1100117    34.46   0.000       3.5758    4.007039
               |
         _cons |   58.58191   17.12276     3.42   0.001      25.0219    92.14192
--------------------------------------------------------------------------------
(est1 stored)

. 
. gen average_submitted_chrg_amt = total_submitted_chrg_amt / total_services

. label variable average_submitted_chrg_amt "Average submitted charge amount"

. 
. eststo: reg average_submitted_chrg_amt total_services total_unique_benes benefi
> ciary_average_age beneficiary_female_count beneficiary_average_risk_score i.npp
> es_entity_code i.nppes_provider_gender i.nppes_provider_state i.year, r
note: 1.nppes_entity_code omitted because of collinearity

Linear regression                               Number of obs     =  2,400,166
                                                F(66, 2400099)    =     989.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0496
                                                Root MSE          =     441.93

--------------------------------------------------------------------------------
               |               Robust
average_subm~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
total_services |  -.0027911   .0001913   -14.59   0.000     -.003166   -.0024162
total_unique~s |   -.008286   .0088025    -0.94   0.347    -.0255386    .0089667
beneficiary~ge |  -1.079169   .1198414    -9.00   0.000    -1.314054   -.8442837
be~emale_count |  -.1048061   .0086893   -12.06   0.000    -.1218368   -.0877753
beneficiary~re |   97.10395   .6949434   139.73   0.000     95.74188    98.46601
               |
nppes_entity~e |
            I  |          0  (omitted)
               |
nppes_provid~r |
            M  |   61.99046   1.433376    43.25   0.000     59.18109    64.79983
               |
nppes_provid~e |
           AE  |  -41.73783   96.79003    -0.43   0.666    -231.4429    147.9672
           AK  |   10.31309    87.0469     0.12   0.906    -160.2958     180.922
           AL  |  -171.4152   86.16935    -1.99   0.047    -340.3041   -2.526326
           AP  |   237.0072   172.4867     1.37   0.169    -101.0607    575.0751
           AR  |  -194.8269   86.17579    -2.26   0.024    -363.7284   -25.92536
           AS  |  -245.6802   157.9179    -1.56   0.120    -555.1938    63.83343
           AZ  |  -190.2451   86.17186    -2.21   0.027    -359.1389   -21.35124
           CA  |  -173.5092   86.16173    -2.01   0.044    -342.3832   -4.635209
           CO  |  -146.2386   86.18951    -1.70   0.090     -315.167    22.68984
           CT  |  -158.9406   86.18511    -1.84   0.065    -327.8604    9.979201
           DC  |   -165.876   86.26961    -1.92   0.055    -334.9614    3.209402
           DE  |   -159.202   86.26125    -1.85   0.065     -328.271    9.867063
           FL  |   -120.946    86.1595    -1.40   0.160    -289.8156    47.92363
           GA  |  -148.7946    86.1665    -1.73   0.084    -317.6779    20.08873
           GU  |  -326.6154       86.8    -3.76   0.000    -496.7403   -156.4904
           HI  |  -221.3795   86.25088    -2.57   0.010    -390.4282   -52.33079
           IA  |  -199.1077   86.17687    -2.31   0.021    -368.0113   -30.20402
           ID  |  -198.2088   86.22707    -2.30   0.022    -367.2109   -29.20681
           IL  |  -137.0307   86.16527    -1.59   0.112    -305.9116    31.85023
           IN  |  -187.1535   86.16432    -2.17   0.030    -356.0326    -18.2745
           KS  |  -201.2724   86.17401    -2.34   0.020    -370.1704   -32.37432
           KY  |  -204.6023   86.16564    -2.37   0.018     -373.484    -35.7207
           LA  |  -158.4057   86.17732    -1.84   0.066    -327.3102    10.49882
           MA  |  -167.8356   86.16309    -1.95   0.051    -336.7122    1.041051
           MD  |  -171.3013   86.16821    -1.99   0.047     -340.188   -2.414617
           ME  |  -208.1912   86.18861    -2.42   0.016    -377.1179   -39.26458
           MI  |  -211.4558   86.16076    -2.45   0.014    -380.3279   -42.58375
           MN  |  -211.4953   86.17554    -2.45   0.014    -380.3963   -42.59422
           MO  |  -173.3068   86.16554    -2.01   0.044    -342.1882   -4.425328
           MP  |  -271.8085   93.13828    -2.92   0.004    -454.3563   -89.26072
           MS  |  -184.3221   86.17532    -2.14   0.032    -353.2227   -15.42152
           MT  |  -209.7435   86.22484    -2.43   0.015    -378.7411    -40.7458
           NC  |  -141.5552   86.16253    -1.64   0.100    -310.4307    27.32036
           ND  |  -204.6375   86.21986    -2.37   0.018    -373.6254   -35.64964
           NE  |  -206.5629   86.18635    -2.40   0.017    -375.4851   -37.64064
           NH  |  -120.8894   86.25239    -1.40   0.161    -289.9411    48.16228
           NJ  |  -128.2227   86.18774    -1.49   0.137    -297.1477    40.70223
           NM  |  -194.4292   86.20109    -2.26   0.024    -363.3803   -25.47805
           NV  |  -144.4927    86.2151    -1.68   0.094    -313.4712    24.48592
           NY  |  -147.7196   86.17017    -1.71   0.086    -316.6101    21.17094
           OH  |  -196.3857   86.16207    -2.28   0.023    -365.2604   -27.51111
           OK  |  -203.7492   86.17242    -2.36   0.018    -372.6441   -34.85424
           OR  |  -164.3428   86.19102    -1.91   0.057    -333.2742    4.588575
           PA  |  -178.5522   86.16446    -2.07   0.038    -347.4315   -9.672861
           PR  |  -401.4834   86.21871    -4.66   0.000     -570.469   -232.4977
           RI  |  -225.5988    86.1963    -2.62   0.009    -394.5405   -56.65703
           SC  |  -121.1166   86.18474    -1.41   0.160    -290.0357    47.80243
           SD  |  -188.8111   86.25546    -2.19   0.029    -357.8688   -19.75342
           TN  |  -150.3056   86.16463    -1.74   0.081    -319.1853    18.57406
           TX  |  -117.0319   86.16117    -1.36   0.174    -285.9048    51.84099
           UT  |  -185.3395    86.2037    -2.15   0.032    -354.2957   -16.38324
           VA  |  -169.6182   86.16412    -1.97   0.049    -338.4969   -.7395829
           VI  |  -228.4753   86.85326    -2.63   0.009    -398.7047   -58.24598
           VT  |  -150.4707   86.39611    -1.74   0.082    -319.8041    18.86263
           WA  |  -190.3219   86.17184    -2.21   0.027    -359.2156   -21.42806
           WI  |  -34.46577   86.21958    -0.40   0.689    -203.4531    134.5216
           WV  |   -198.542   86.17995    -2.30   0.021    -367.4517   -29.63236
           WY  |  -190.7444   86.32252    -2.21   0.027    -359.9335   -21.55527
               |
          year |
         2013  |    15.5736    .684993    22.74   0.000     14.23104    16.91616
         2014  |   29.33734   .6985787    42.00   0.000     27.96815    30.70653
               |
         _cons |   373.9414   86.41745     4.33   0.000     204.5662    543.3165
--------------------------------------------------------------------------------
(est2 stored)

. 
. gen average_medicare_payment_amt = total_medicare_payment_amt / total_services

. label variable average_medicare_payment_amt "Average Medicare payment amount"

. 
. eststo: reg average_medicare_payment_amt total_services total_unique_benes bene
> ficiary_average_age beneficiary_female_count beneficiary_average_risk_score i.n
> ppes_entity_code i.nppes_provider_gender i.nppes_provider_state i.year, r
note: 1.nppes_entity_code omitted because of collinearity

Linear regression                               Number of obs     =  2,400,166
                                                F(66, 2400099)    =    1742.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0903
                                                Root MSE          =     53.835

--------------------------------------------------------------------------------
               |               Robust
average_~t_amt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
total_services |  -.0004926   .0000325   -15.16   0.000    -.0005564   -.0004289
total_unique~s |  -.0036819   .0014799    -2.49   0.013    -.0065824   -.0007814
beneficiary~ge |   .2699402   .0199362    13.54   0.000     .2308659    .3090144
be~emale_count |  -.0131144    .001468    -8.93   0.000    -.0159916   -.0102372
beneficiary~re |   16.97204   .1027674   165.15   0.000     16.77062    17.17346
               |
nppes_entity~e |
            I  |          0  (omitted)
               |
nppes_provid~r |
            M  |   13.89085   .2283396    60.83   0.000     13.44332    14.33839
               |
nppes_provid~e |
           AE  |  -22.77368   13.57617    -1.68   0.093     -49.3825    3.835144
           AK  |  -.4055603   13.23651    -0.03   0.976    -26.34865    25.53753
           AL  |  -22.43626    13.1979    -1.70   0.089    -48.30368    3.431166
           AP  |   5.530097    15.1098     0.37   0.714    -24.08458    35.14477
           AR  |   -20.5352   13.20066    -1.56   0.120    -46.40803    5.337631
           AS  |  -61.66698   20.16046    -3.06   0.002    -101.1808   -22.15319
           AZ  |  -16.89469   13.19929    -1.28   0.201    -42.76484    8.975462
           CA  |  -13.70485   13.19801    -1.04   0.299    -39.57248    12.16277
           CO  |  -15.38869   13.20054    -1.17   0.244    -41.26129     10.4839
           CT  |    -18.752   13.19964    -1.42   0.155    -44.62284    7.118832
           DC  |  -6.801457   13.21782    -0.51   0.607    -32.70793    19.10501
           DE  |  -18.80904   13.20372    -1.42   0.154    -44.68787    7.069792
           FL  |  -12.50471    13.1968    -0.95   0.343    -38.36997    13.36055
           GA  |  -20.70979   13.19731    -1.57   0.117    -46.57607    5.156481
           GU  |  -28.55763   13.33764    -2.14   0.032    -54.69893   -2.416335
           HI  |  -19.55366   13.21014    -1.48   0.139    -45.44508    6.337752
           IA  |  -26.83799   13.19961    -2.03   0.042    -52.70875   -.9672259
           ID  |  -20.89907   13.20858    -1.58   0.114    -46.78743    4.989297
           IL  |  -17.43161   13.19734    -1.32   0.187    -43.29794     8.43472
           IN  |  -22.64334   13.19756    -1.72   0.086     -48.5101    3.223412
           KS  |   -21.7773   13.19994    -1.65   0.099    -47.64872    4.094128
           KY  |  -24.43715   13.19803    -1.85   0.064    -50.30482    1.430522
           LA  |  -21.27143   13.20576    -1.61   0.107    -47.15426      4.6114
           MA  |  -17.25903   13.19785    -1.31   0.191    -43.12636    8.608306
           MD  |  -11.21784   13.19877    -0.85   0.395    -37.08698    14.65129
           ME  |  -22.01786   13.20201    -1.67   0.095    -47.89334    3.857622
           MI  |  -20.97915   13.19764    -1.59   0.112    -46.84606     4.88776
           MN  |  -24.82113   13.20261    -1.88   0.060    -50.69777    1.055517
           MO  |  -18.53185   13.19819    -1.40   0.160    -44.39985     7.33615
           MP  |  -36.68588    13.7081    -2.68   0.007    -63.55328   -9.818482
           MS  |  -25.12981   13.19908    -1.90   0.057    -50.99954    .7399202
           MT  |  -19.02165   13.21138    -1.44   0.150     -44.9155    6.872202
           NC  |  -22.31048   13.19683    -1.69   0.091     -48.1758    3.554842
           ND  |  -23.94735   13.20816    -1.81   0.070    -49.83487    1.940174
           NE  |  -25.83388   13.20185    -1.96   0.050    -51.70904    .0412746
           NH  |  -16.40318    13.2029    -1.24   0.214    -42.28041    9.474052
           NJ  |  -17.80679   13.19767    -1.35   0.177    -43.67376    8.060182
           NM  |  -21.78619   13.20323    -1.65   0.099    -47.66406    4.091685
           NV  |   -14.9742   13.20257    -1.13   0.257    -40.85078    10.90238
           NY  |  -17.72588   13.19838    -1.34   0.179    -43.59425    8.142489
           OH  |   -21.7794   13.19766    -1.65   0.099    -47.64635     4.08755
           OK  |   -22.7864   13.19929    -1.73   0.084    -48.65655    3.083759
           OR  |  -18.72919   13.20511    -1.42   0.156    -44.61075    7.152369
           PA  |  -20.37218    13.1981    -1.54   0.123       -46.24     5.49564
           PR  |   -36.3762    13.2093    -2.75   0.006    -62.26597   -10.48643
           RI  |  -18.82475   13.20366    -1.43   0.154    -44.70347    7.053966
           SC  |  -23.39433   13.19772    -1.77   0.076     -49.2614    2.472752
           SD  |  -25.69748   13.20607    -1.95   0.052    -51.58091    .1859425
           TN  |  -22.80985   13.19749    -1.73   0.084    -48.67647    3.056775
           TX  |  -18.87313   13.19726    -1.43   0.153    -44.73929    6.993041
           UT  |  -16.06489   13.20643    -1.22   0.224    -41.94903    9.819247
           VA  |  -19.78189   13.19728    -1.50   0.134    -45.64809    6.084316
           VI  |  -16.31222   13.32385    -1.22   0.221    -42.42651    9.802067
           VT  |  -22.61038   13.21357    -1.71   0.087    -48.50851    3.287755
           WA  |  -18.62715   13.20056    -1.41   0.158    -44.49978    7.245477
           WI  |  -26.41646   13.19907    -2.00   0.045    -52.28616   -.5467471
           WV  |  -23.19903   13.19991    -1.76   0.079    -49.07039    2.672337
           WY  |  -21.86747   13.21823    -1.65   0.098    -47.77474    4.039802
               |
          year |
         2013  |   .0491472   .0835664     0.59   0.556      -.11464    .2129344
         2014  |   1.891173   .0865813    21.84   0.000     1.721477    2.060869
               |
         _cons |   37.34351   13.24442     2.82   0.005     11.38491    63.30211
--------------------------------------------------------------------------------
(est3 stored)

. 
. estwide using RichardOuyang_aggregate1.tex, se nocons star label title("Average
>  Cost per Healthcare Service over Time, by Provider\label{table:aggregate1}") b
> ooktabs replace keep(*.year) b(a3) nonotes
(output written to RichardOuyang_aggregate1.tex)

. 
. ***** DRUG *****

. 
. eststo clear

. 
. gen avg_drug_medicare_allowed_amt = total_drug_medicare_allowed_amt / total_ser
> vices
(299,903 missing values generated)

. label variable avg_drug_medicare_allowed_amt "Average drug Medicare allowed amo
> unt"

. 
. eststo: reg avg_drug_medicare_allowed_amt total_services total_unique_benes ben
> eficiary_average_age beneficiary_female_count beneficiary_average_risk_score i.
> nppes_entity_code i.nppes_provider_gender i.nppes_provider_state i.year, r
note: 1.nppes_entity_code omitted because of collinearity

Linear regression                               Number of obs     =  2,135,045
                                                F(66, 2134978)    =     206.61
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0063
                                                Root MSE          =     15.479

--------------------------------------------------------------------------------
               |               Robust
avg_drug_med~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
total_services |   .0000838   4.13e-06    20.30   0.000     .0000757    .0000919
total_unique~s |   .0020319   .0001473    13.80   0.000     .0017433    .0023205
beneficiary~ge |    .069044   .0028896    23.89   0.000     .0633804    .0747076
be~emale_count |  -.0033285   .0001774   -18.77   0.000    -.0036761   -.0029808
beneficiary~re |  -.5085167   .0147409   -34.50   0.000    -.5374083    -.479625
               |
nppes_entity~e |
            I  |          0  (omitted)
               |
nppes_provid~r |
            M  |    .267176   .0263248    10.15   0.000     .2155803    .3187718
               |
nppes_provid~e |
           AE  |    .194174   .1357938     1.43   0.153    -.0719772    .4603252
           AK  |   1.079448   .1138453     9.48   0.000     .8563153    1.302581
           AL  |   .7723168   .0782297     9.87   0.000     .6189893    .9256444
           AP  |   .0255485   .0999527     0.26   0.798    -.1703554    .2214524
           AR  |   .7050946   .0858933     8.21   0.000     .5367466    .8734425
           AS  |   .5531711   .4602496     1.20   0.229    -.3489021    1.455244
           AZ  |   .8676964   .0795746    10.90   0.000     .7117329     1.02366
           CA  |   1.006464    .075296    13.37   0.000     .8588861    1.154041
           CO  |   1.144547   .0829518    13.80   0.000     .9819647     1.30713
           CT  |   1.054156   .0853284    12.35   0.000     .8869151    1.221396
           DC  |   .8714228   .0834019    10.45   0.000      .707958    1.034888
           DE  |   1.023476   .1000084    10.23   0.000     .8274628    1.219489
           FL  |   .8270372   .0758966    10.90   0.000     .6782825    .9757919
           GA  |   1.033252   .0778138    13.28   0.000       .88074    1.185765
           GU  |   1.036549   .2261527     4.58   0.000     .5932978      1.4798
           HI  |   .6505298   .1010112     6.44   0.000     .4525514    .8485083
           IA  |   .9041362   .0943836     9.58   0.000     .7191476    1.089125
           ID  |   .4605989   .0903271     5.10   0.000      .283561    .6376368
           IL  |   .9327228   .0758213    12.30   0.000     .7841158     1.08133
           IN  |   1.127226   .0810303    13.91   0.000     .9684099    1.286043
           KS  |   1.130635   .0944159    11.98   0.000     .9455832    1.315687
           KY  |   .8992193   .0797509    11.28   0.000     .7429103    1.055528
           LA  |   .9804742   .0787209    12.46   0.000     .8261841    1.134764
           MA  |    .813587    .076042    10.70   0.000     .6645473    .9626268
           MD  |   1.141966   .0810708    14.09   0.000     .9830703    1.300862
           ME  |   .8020912   .1063667     7.54   0.000     .5936162    1.010566
           MI  |   .8888766   .0760386    11.69   0.000     .7398437     1.03791
           MN  |   1.206036   .0802885    15.02   0.000     1.048673    1.363398
           MO  |   .9821284   .0769801    12.76   0.000       .83125    1.133007
           MP  |   .1245477   .1148436     1.08   0.278    -.1005417    .3496371
           MS  |   .8277542   .0838269     9.87   0.000     .6634565    .9920519
           MT  |   .6306207   .0952817     6.62   0.000      .443872    .8173694
           NC  |   1.028889   .0765135    13.45   0.000     .8789252    1.178853
           ND  |   .6154414   .1201812     5.12   0.000     .3798905    .8509923
           NE  |   1.112727   .1055827    10.54   0.000     .9057887    1.319665
           NH  |   .6459905   .0880082     7.34   0.000     .4734976    .8184835
           NJ  |   .9334929   .0779229    11.98   0.000     .7807667    1.086219
           NM  |   .9064728   .0880682    10.29   0.000     .7338622    1.079083
           NV  |   .9017346   .0875806    10.30   0.000     .7300797     1.07339
           NY  |    1.00888   .1254104     8.04   0.000     .7630804     1.25468
           OH  |   1.008938   .0755088    13.36   0.000     .8609432    1.156932
           OK  |   .8172431   .0787223    10.38   0.000     .6629501    .9715361
           OR  |   1.468118   .3525484     4.16   0.000     .7771352      2.1591
           PA  |   1.254692   .0906459    13.84   0.000     1.077029    1.432355
           PR  |   .3554685   .0889267     4.00   0.000     .1811752    .5297618
           RI  |   1.084884   .1262197     8.60   0.000     .8374974     1.33227
           SC  |   .7521201   .0763995     9.84   0.000     .6023797    .9018605
           SD  |   .6032648   .1061058     5.69   0.000     .3953012    .8112284
           TN  |   1.021731   .0803096    12.72   0.000     .8643268    1.179135
           TX  |   1.040083   .0746625    13.93   0.000     .8937472    1.186419
           UT  |    1.17766   .1083883    10.87   0.000      .965223    1.390097
           VA  |   .8939171   .0784386    11.40   0.000     .7401803    1.047654
           VI  |   .7904392   .3252345     2.43   0.015     .1529909    1.427887
           VT  |   .3604997   .1063146     3.39   0.001     .1521269    .5688725
           WA  |   1.227521    .212042     5.79   0.000     .8119261    1.643116
           WI  |   1.202616   .0869757    13.83   0.000     1.032147    1.373086
           WV  |   .6540838   .0850576     7.69   0.000     .4873738    .8207938
           WY  |   .4958035   .0911113     5.44   0.000     .3172285    .6743785
               |
          year |
         2013  |   .1070866   .0187973     5.70   0.000     .0702446    .1439286
         2014  |   .2073031   .0295613     7.01   0.000      .149364    .2652423
               |
         _cons |  -4.391866   .2017699   -21.77   0.000    -4.787328   -3.996404
--------------------------------------------------------------------------------
(est1 stored)

. 
. gen avg_drug_submitted_chrg_amt = total_drug_submitted_chrg_amt / total_service
> s
(299,903 missing values generated)

. label variable avg_drug_submitted_chrg_amt "Average drug submitted charge amoun
> t"

. 
. eststo: reg avg_drug_submitted_chrg_amt total_services total_unique_benes benef
> iciary_average_age beneficiary_female_count beneficiary_average_risk_score i.np
> pes_entity_code i.nppes_provider_gender i.nppes_provider_state i.year, r
note: 1.nppes_entity_code omitted because of collinearity

Linear regression                               Number of obs     =  2,135,045
                                                F(66, 2134978)    =     241.47
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0068
                                                Root MSE          =     31.782

--------------------------------------------------------------------------------
               |               Robust
avg_drug_sub~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
total_services |   .0001834   8.91e-06    20.58   0.000     .0001659    .0002009
total_unique~s |   .0060805   .0003319    18.32   0.000     .0054299    .0067311
beneficiary~ge |   .1199488   .0051003    23.52   0.000     .1099523    .1299453
be~emale_count |   -.010418   .0004285   -24.31   0.000    -.0112578   -.0095781
beneficiary~re |  -.9975164   .0200892   -49.65   0.000     -1.03689   -.9581423
               |
nppes_entity~e |
            I  |          0  (omitted)
               |
nppes_provid~r |
            M  |   .5871916   .0525321    11.18   0.000     .4842305    .6901527
               |
nppes_provid~e |
           AE  |  -.3537354   .7539131    -0.47   0.639    -1.831379    1.123908
           AK  |    1.34977   .7372854     1.83   0.067    -.0952834    2.794824
           AL  |   .5984133   .7157093     0.84   0.403    -.8043519    2.001179
           AP  |  -.8525364   .7268043    -1.17   0.241    -2.277047    .5719745
           AR  |    .466713   .7193214     0.65   0.516    -.9431318    1.876558
           AS  |   .3559161   1.163318     0.31   0.760    -1.924147    2.635979
           AZ  |   .8878929   .7165071     1.24   0.215     -.516436    2.292222
           CA  |   1.285183   .7154259     1.80   0.072    -.1170269    2.687393
           CO  |   1.199743   .7178161     1.67   0.095    -.2071514    2.606638
           CT  |   .8857572   .7171253     1.24   0.217    -.5197833    2.291298
           DC  |   .8690608   .7238557     1.20   0.230    -.5496711    2.287793
           DE  |   1.100985   .7237204     1.52   0.128    -.3174813    2.519452
           FL  |   .6805029   .7153083     0.95   0.341    -.7214764    2.082482
           GA  |   1.592258   .7171778     2.22   0.026     .1866149    2.997902
           GU  |   .6609222    .849993     0.78   0.437    -1.005034    2.326879
           HI  |   .3637752    .725168     0.50   0.616    -1.057529    1.785079
           IA  |   .5790796   .7199961     0.80   0.421    -.8320876    1.990247
           ID  |  -.3440954   .7176938    -0.48   0.632     -1.75075    1.062559
           IL  |   1.124688    .715261     1.57   0.116    -.2771986    2.526575
           IN  |   1.327736   .7163877     1.85   0.064    -.0763586    2.731831
           KS  |   1.234564    .722309     1.71   0.087    -.1811365    2.650264
           KY  |   1.060375    .716387     1.48   0.139    -.3437182    2.464469
           LA  |   1.427888     .71717     1.99   0.046       .02226    2.833516
           MA  |   .5882839   .7154671     0.82   0.411    -.8140067    1.990574
           MD  |   1.006665   .7163997     1.41   0.160    -.3974534    2.410783
           ME  |    .194515   .7228411     0.27   0.788    -1.222228    1.611258
           MI  |   .5398935   .7150596     0.76   0.450    -.8615985    1.941385
           MN  |   1.220338   .7173118     1.70   0.089    -.1855677    2.626245
           MO  |   1.065206    .715851     1.49   0.137    -.3378365    2.468249
           MP  |  -.6191854   .7565639    -0.82   0.413    -2.102024    .8636535
           MS  |   1.137196   .7188026     1.58   0.114    -.2716324    2.546024
           MT  |   .0975537   .7208638     0.14   0.892    -1.315314    1.510422
           NC  |   1.274282   .7154017     1.78   0.075    -.1278806    2.676444
           ND  |   .0444282   .7271971     0.06   0.951    -1.380853    1.469709
           NE  |   .9502751   .7224835     1.32   0.188    -.4657673    2.366318
           NH  |   .3573477   .7183859     0.50   0.619    -1.050664    1.765359
           NJ  |   .8280707   .7159082     1.16   0.247    -.5750844    2.231226
           NM  |   .9717629   .7201185     1.35   0.177    -.4396442     2.38317
           NV  |   1.212955   .7209354     1.68   0.092    -.2000529    2.625964
           NY  |   1.063077   .7649376     1.39   0.165    -.4361738    2.562328
           OH  |   .9967814   .7152689     1.39   0.163    -.4051206    2.398683
           OK  |   .9978754   .7168735     1.39   0.164    -.4071716    2.402923
           OR  |   1.375073   .7960785     1.73   0.084    -.1852127    2.935359
           PA  |   1.409762   .7180703     1.96   0.050     .0023689    2.817155
           PR  |  -.2492657   .7226049    -0.34   0.730    -1.665546    1.167015
           RI  |   .9378647   .7284079     1.29   0.198    -.4897893    2.365519
           SC  |   .9316251   .7161034     1.30   0.193    -.4719125    2.335163
           SD  |  -.0600386   .7239282    -0.08   0.934    -1.478913    1.358835
           TN  |   1.373995   .7177445     1.91   0.056    -.0327587     2.78075
           TX  |   1.656093   .7154272     2.31   0.021     .2538803    3.058305
           UT  |    1.21873   .7261545     1.68   0.093    -.2045072    2.641968
           VA  |   .7406363   .7154357     1.04   0.301    -.6615928    2.142865
           VI  |   2.793092   1.968089     1.42   0.156    -1.064293    6.650477
           VT  |  -.0522027   .7377212    -0.07   0.944     -1.49811    1.393705
           WA  |    1.11973   .7433518     1.51   0.132    -.3372141    2.576673
           WI  |   1.558431   .7181428     2.17   0.030     .1508957    2.965965
           WV  |   .3746886   .7170243     0.52   0.601    -1.030654    1.780031
           WY  |   .3862528   .7294224     0.53   0.596     -1.04339    1.815895
               |
          year |
         2013  |   .1734665   .0249661     6.95   0.000     .1245338    .2223992
         2014  |   .3126629   .0619396     5.05   0.000     .1912634    .4340625
               |
         _cons |  -6.556753    .797272    -8.22   0.000    -8.119378   -4.994127
--------------------------------------------------------------------------------
(est2 stored)

. 
. gen avg_drug_medicare_payment_amt = total_drug_medicare_payment_amt / total_ser
> vices
(299,903 missing values generated)

. label variable avg_drug_medicare_payment_amt "Average drug Medicare payment amo
> unt"

. 
. eststo: reg avg_drug_medicare_payment_amt total_services total_unique_benes ben
> eficiary_average_age beneficiary_female_count beneficiary_average_risk_score i.
> nppes_entity_code i.nppes_provider_gender i.nppes_provider_state i.year, r
note: 1.nppes_entity_code omitted because of collinearity

Linear regression                               Number of obs     =  2,135,045
                                                F(66, 2134978)    =     230.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0063
                                                Root MSE          =     12.159

--------------------------------------------------------------------------------
               |               Robust
avg_drug~t_amt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
total_services |   .0000653   3.21e-06    20.33   0.000      .000059    .0000716
total_unique~s |   .0015871   .0001144    13.88   0.000     .0013629    .0018112
beneficiary~ge |   .0557436   .0022628    24.64   0.000     .0513087    .0601786
be~emale_count |  -.0026138   .0001381   -18.93   0.000    -.0028845   -.0023432
beneficiary~re |  -.4328815    .011562   -37.44   0.000    -.4555425   -.4102204
               |
nppes_entity~e |
            I  |          0  (omitted)
               |
nppes_provid~r |
            M  |   .1806639   .0205601     8.79   0.000     .1403669    .2209609
               |
nppes_provid~e |
           AE  |   .1772687   .1237524     1.43   0.152    -.0652817     .419819
           AK  |   .8371052   .0898526     9.32   0.000     .6609973    1.013213
           AL  |   .5996403   .0623041     9.62   0.000     .4775265    .7217541
           AP  |   .0107207   .0797365     0.13   0.893    -.1455599    .1670014
           AR  |   .5541773   .0682651     8.12   0.000     .4203801    .6879744
           AS  |   .3894299   .3863988     1.01   0.314    -.3678982    1.146758
           AZ  |   .7017906    .063424    11.07   0.000     .5774818    .8260993
           CA  |   .8241147   .0600847    13.72   0.000     .7063507    .9418786
           CO  |   .9191076   .0660184    13.92   0.000     .7897138    1.048501
           CT  |   .8502398   .0678727    12.53   0.000     .7172117     .983268
           DC  |   .7233213   .0667122    10.84   0.000     .5925676    .8540749
           DE  |   .8273866   .0793236    10.43   0.000     .6719151    .9828581
           FL  |   .6698805   .0605843    11.06   0.000     .5511373    .7886237
           GA  |   .8310156   .0620547    13.39   0.000     .7093906    .9526406
           GU  |    .872753   .1803981     4.84   0.000     .5191791    1.226327
           HI  |   .5160122   .0793399     6.50   0.000     .3605088    .6715156
           IA  |   .7098412   .0749268     9.47   0.000     .5629872    .8566952
           ID  |   .3545826   .0717074     4.94   0.000     .2140385    .4951266
           IL  |   .7541521   .0605073    12.46   0.000     .6355599    .8727444
           IN  |   .9269207    .064607    14.35   0.000     .8002933    1.053548
           KS  |    .907735   .0750154    12.10   0.000     .7607073    1.054763
           KY  |   .7280219   .0635876    11.45   0.000     .6033924    .8526514
           LA  |   .7834408   .0627354    12.49   0.000     .6604817    .9063999
           MA  |   .6651351   .0606965    10.96   0.000      .546172    .7840981
           MD  |   .9347337   .0645657    14.48   0.000     .8081872     1.06128
           ME  |   .6190064   .0842141     7.35   0.000     .4539497    .7840631
           MI  |   .7161065   .0606761    11.80   0.000     .5971835    .8350295
           MN  |   .9666253   .0639286    15.12   0.000     .8413275    1.091923
           MO  |   .7948183   .0614403    12.94   0.000     .6743974    .9152392
           MP  |   .1022125   .0933637     1.09   0.274    -.0807772    .2852021
           MS  |   .6498425   .0666699     9.75   0.000     .5191718    .7805131
           MT  |   .4743232   .0754346     6.29   0.000     .3264739    .6221724
           NC  |   .8280394   .0610656    13.56   0.000     .7083531    .9477258
           ND  |    .459111   .0950731     4.83   0.000      .272771    .6454511
           NE  |   .8758756   .0835265    10.49   0.000     .7121666    1.039585
           NH  |   .5120024   .0699752     7.32   0.000     .3748535    .6491514
           NJ  |   .7639763   .0621334    12.30   0.000      .642197    .8857557
           NM  |   .7104877   .0698892    10.17   0.000     .5735073     .847468
           NV  |   .7235736   .0694579    10.42   0.000     .5874386    .8597087
           NY  |   .8080126   .0989416     8.17   0.000     .6140906    1.001935
           OH  |   .8201573   .0602635    13.61   0.000     .7020429    .9382716
           OK  |    .641661   .0627259    10.23   0.000     .5187204    .7646016
           OR  |   1.161937      .2766     4.20   0.000     .6198107    1.704063
           PA  |   1.029422   .0720669    14.28   0.000     .8881731     1.17067
           PR  |   .2750488   .0705408     3.90   0.000     .1367913    .4133064
           RI  |   .8537482   .0997994     8.55   0.000      .658145    1.049352
           SC  |   .6036793    .060929     9.91   0.000     .4842607    .7230979
           SD  |   .4577102   .0839593     5.45   0.000     .2931528    .6222675
           TN  |   .8096093   .0639303    12.66   0.000     .6843081    .9349104
           TX  |   .8312148   .0595963    13.95   0.000     .7144081    .9480215
           UT  |    .927326   .0857081    10.82   0.000     .7593411    1.095311
           VA  |   .7246872   .0625649    11.58   0.000     .6020623    .8473122
           VI  |    .599321   .2532053     2.37   0.018     .1030474    1.095595
           VT  |   .2667618   .0843194     3.16   0.002     .1014987    .4320248
           WA  |   .9653668   .1675134     5.76   0.000     .6370463    1.293687
           WI  |   .9565997   .0692935    13.81   0.000     .8207868    1.092413
           WV  |    .519039   .0676505     7.67   0.000     .3864463    .6516317
           WY  |   .3756864   .0722829     5.20   0.000     .2340144    .5173584
               |
          year |
         2013  |   .0731231   .0148315     4.93   0.000      .044054    .1021923
         2014  |   .1608654   .0232251     6.93   0.000      .115345    .2063857
               |
         _cons |  -3.461288   .1586003   -21.82   0.000    -3.772139   -3.150437
--------------------------------------------------------------------------------
(est3 stored)

. 
. estwide using RichardOuyang_aggregatedrug.tex, se nocons star label title("Aver
> age Cost per Drug Service over Time, by Provider\label{table:aggregatedrug}") b
> ooktabs replace keep(*.year) b(a3) nonotes
(output written to RichardOuyang_aggregatedrug.tex)

. 
. ***** MEDICAL *****

. 
. eststo clear

. 
. gen avg_med_medicare_allowed_amt = total_med_medicare_allowed_amt / total_servi
> ces
(299,903 missing values generated)

. label variable avg_med_medicare_allowed_amt "Average medical Medicare allowed a
> mount"

. 
. eststo: reg avg_med_medicare_allowed_amt total_services total_unique_benes bene
> ficiary_average_age beneficiary_female_count beneficiary_average_risk_score i.n
> ppes_entity_code i.nppes_provider_gender i.nppes_provider_state i.year, r
note: 1.nppes_entity_code omitted because of collinearity

Linear regression                               Number of obs     =  2,135,045
                                                F(66, 2134978)    =    1425.33
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1052
                                                Root MSE          =     66.351

--------------------------------------------------------------------------------
               |               Robust
avg_med_medi~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
total_services |  -.0007295   .0000466   -15.64   0.000    -.0008208   -.0006381
total_unique~s |  -.0062007   .0023425    -2.65   0.008    -.0107919   -.0016094
beneficiary~ge |   .0910071   .0293669     3.10   0.002     .0334491    .1485651
be~emale_count |  -.0159475   .0023044    -6.92   0.000    -.0204641   -.0114309
beneficiary~re |    22.1522   .1463953   151.32   0.000     21.86527    22.43913
               |
nppes_entity~e |
            I  |          0  (omitted)
               |
nppes_provid~r |
            M  |   17.36917   .3488725    49.79   0.000     16.68539    18.05295
               |
nppes_provid~e |
           AE  |  -25.22495    18.5293    -1.36   0.173    -61.54173    11.09182
           AK  |   4.260463   18.11046     0.24   0.814     -31.2354    39.75633
           AL  |  -28.52465   18.04612    -1.58   0.114    -63.89442    6.845117
           AP  |   11.89029   20.76665     0.57   0.567    -28.81161     52.5922
           AR  |  -24.68383   18.04998    -1.37   0.171    -60.06115    10.69349
           AS  |  -63.31722   21.52192    -2.94   0.003    -105.4994     -21.135
           AZ  |  -21.19409   18.04904    -1.17   0.240    -56.56958     14.1814
           CA  |   -17.1642   18.04756    -0.95   0.342    -52.53678    18.20838
           CO  |  -18.57797   18.05131    -1.03   0.303     -53.9579    16.80197
           CT  |  -24.21792   18.04979    -1.34   0.180    -59.59488    11.15904
           DC  |  -7.244932   18.07658    -0.40   0.689     -42.6744    28.18454
           DE  |  -24.62711   18.05433    -1.36   0.173    -60.01296    10.75874
           FL  |  -15.07355   18.04489    -0.84   0.404     -50.4409    20.29381
           GA  |  -26.66569   18.04584    -1.48   0.139     -62.0349    8.703518
           GU  |  -32.49055   18.25743    -1.78   0.075    -68.27447    3.293365
           HI  |   -20.6283    18.0665    -1.14   0.254    -56.03802    14.78141
           IA  |  -33.18341   18.04934    -1.84   0.066     -68.5595    2.192674
           ID  |  -23.68679   18.06441    -1.31   0.190     -59.0924    11.71881
           IL  |  -21.84027   18.04611    -1.21   0.226    -57.21003    13.52948
           IN  |  -28.35096   18.04605    -1.57   0.116    -63.72058    7.018661
           KS  |  -27.23817   18.04958    -1.51   0.131    -62.61471    8.138379
           KY  |  -31.37168   18.04655    -1.74   0.082    -66.74228    3.998925
           LA  |  -27.67635   18.04881    -1.53   0.125    -63.05138    7.698684
           MA  |  -22.02741     18.047    -1.22   0.222     -57.3989    13.34407
           MD  |  -13.91993   18.04803    -0.77   0.441    -49.29344    21.45359
           ME  |   -28.1152   18.05201    -1.56   0.119    -63.49651    7.266102
           MI  |  -26.61489   18.04673    -1.47   0.140    -61.98587    8.756075
           MN  |  -31.95711   18.05121    -1.77   0.077    -67.33685    3.422619
           MO  |  -22.90645   18.04708    -1.27   0.204     -58.2781     12.4652
           MP  |  -39.71898   18.80535    -2.11   0.035    -76.57682   -2.861148
           MS  |  -31.90751   18.04776    -1.77   0.077    -67.28049    3.465468
           MT  |  -22.49437   18.06766    -1.25   0.213    -57.90635    12.91761
           NC  |  -28.71181   18.04501    -1.59   0.112     -64.0794    6.655782
           ND  |  -28.73007   18.06228    -1.59   0.112     -64.1315    6.671364
           NE  |  -32.76258   18.05273    -1.81   0.070     -68.1453    2.620145
           NH  |  -19.93832   18.05382    -1.10   0.269    -55.32317    15.44653
           NJ  |  -23.05632   18.04667    -1.28   0.201    -58.42716    12.31453
           NM  |  -25.91404   18.05505    -1.44   0.151    -61.30131    9.473228
           NV  |  -17.61084   18.05326    -0.98   0.329     -52.9946    17.77292
           NY  |  -22.97944   18.04808    -1.27   0.203    -58.35305    12.39417
           OH  |  -27.33894   18.04684    -1.51   0.130    -62.71011    8.032225
           OK  |  -28.02205    18.0486    -1.55   0.121    -63.39667    7.352571
           OR  |  -22.66921   18.05462    -1.26   0.209    -58.05563    12.71722
           PA  |  -25.91735   18.04779    -1.44   0.151    -61.29039    9.455696
           PR  |  -44.06633   18.06692    -2.44   0.015    -79.47686   -8.655791
           RI  |  -23.39147   18.05575    -1.30   0.195     -58.7801    11.99716
           SC  |  -29.44966   18.04598    -1.63   0.103    -64.81914    5.919825
           SD  |  -31.87119   18.05898    -1.76   0.078    -67.26617    3.523782
           TN  |  -29.09822   18.04594    -1.61   0.107    -64.46762    6.271188
           TX  |  -23.51784   18.04576    -1.30   0.192    -58.88689    11.85122
           UT  |   -18.8682   18.06085    -1.04   0.296    -54.26683    16.53044
           VA  |  -24.59865   18.04572    -1.36   0.173    -59.96763    10.77034
           VI  |  -17.10789   18.24266    -0.94   0.348    -52.86288    18.64709
           VT  |  -27.09027   18.06885    -1.50   0.134    -62.50459    8.324051
           WA  |  -22.13465    18.0508    -1.23   0.220     -57.5136    13.24429
           WI  |  -33.71002   18.04948    -1.87   0.062    -69.08637     1.66633
           WV  |  -29.10446   18.04914    -1.61   0.107    -64.48015    6.271226
           WY  |  -26.56552   18.07683    -1.47   0.142    -61.99547    8.864439
               |
          year |
         2013  |   1.502607   .1113229    13.50   0.000     1.284418    1.720796
         2014  |    3.84209   .1121348    34.26   0.000     3.622309     4.06187
               |
         _cons |   67.19307   18.11421     3.71   0.000     31.68985    102.6963
--------------------------------------------------------------------------------
(est1 stored)

. 
. gen avg_med_submitted_chrg_amt = total_med_submitted_chrg_amt / total_services
(299,903 missing values generated)

. label variable avg_med_submitted_chrg_amt "Average medical submitted charge amo
> unt"

. 
. eststo: reg avg_med_submitted_chrg_amt total_services total_unique_benes benefi
> ciary_average_age beneficiary_female_count beneficiary_average_risk_score i.npp
> es_entity_code i.nppes_provider_gender i.nppes_provider_state i.year, r
note: 1.nppes_entity_code omitted because of collinearity

Linear regression                               Number of obs     =  2,135,045
                                                F(66, 2134978)    =     907.63
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0544
                                                Root MSE          =     453.72

--------------------------------------------------------------------------------
               |               Robust
avg_med_subm~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
total_services |  -.0029975    .000203   -14.77   0.000    -.0033954   -.0025996
total_unique~s |  -.0180547   .0105313    -1.71   0.086    -.0386957    .0025864
beneficiary~ge |  -1.582991   .1354379   -11.69   0.000    -1.848445   -1.317538
be~emale_count |  -.0950333   .0103623    -9.17   0.000    -.1153429   -.0747236
beneficiary~re |    106.274    .774183   137.27   0.000     104.7567    107.7914
               |
nppes_entity~e |
            I  |          0  (omitted)
               |
nppes_provid~r |
            M  |   57.99731   1.655978    35.02   0.000     54.75165    61.24297
               |
nppes_provid~e |
           AE  |   7.485423   103.2093     0.07   0.942    -194.8012     209.772
           AK  |   39.57156   92.46163     0.43   0.669      -141.65    220.7931
           AL  |   -159.352   91.29473    -1.75   0.081    -338.2865    19.58252
           AP  |   309.0779   193.6992     1.60   0.111    -70.56584    688.7216
           AR  |   -182.708   91.30258    -2.00   0.045    -361.6579   -3.758169
           AS  |  -229.7651   176.7515    -1.30   0.194    -576.1918    116.6617
           AZ  |  -180.3844   91.30136    -1.98   0.048    -359.3319   -1.436959
           CA  |  -163.4255   91.29123    -1.79   0.073    -342.3531    15.50211
           CO  |  -127.8081   91.32415    -1.40   0.162    -306.8003      51.184
           CT  |   -149.661    91.3173    -1.64   0.101    -328.6397    29.31774
           DC  |  -153.2438   91.41698    -1.68   0.094    -332.4179    25.93027
           DE  |  -151.6381   91.39597    -1.66   0.097     -330.771    27.49477
           FL  |  -103.7451    91.2854    -1.14   0.256    -282.6613    75.17106
           GA  |  -139.9432    91.2936    -1.53   0.125    -318.8755    38.98902
           GU  |  -315.3233   92.03958    -3.43   0.001    -495.7176   -134.9289
           HI  |   -207.292   91.40028    -2.27   0.023    -386.4334   -28.15069
           IA  |  -188.0447   91.30715    -2.06   0.039    -367.0035   -9.085842
           ID  |  -177.7926   91.37457    -1.95   0.052    -356.8835    1.298375
           IL  |  -128.3301   91.29301    -1.41   0.160    -307.2612    50.60105
           IN  |  -179.4564    91.2908    -1.97   0.049    -358.3832   -.5296664
           KS  |  -193.7188   91.30173    -2.12   0.034     -372.667   -14.77063
           KY  |  -193.6385   91.29243    -2.12   0.034    -372.5685   -14.70856
           LA  |  -150.2056   91.30385    -1.65   0.100     -329.158    28.74678
           MA  |  -162.1876   91.29144    -1.78   0.076    -341.1157    16.74039
           MD  |  -160.9708   91.29632    -1.76   0.078    -339.9084    17.96683
           ME  |  -200.7805   91.31752    -2.20   0.028    -379.7597   -21.80139
           MI  |  -200.8606   91.28917    -2.20   0.028    -379.7842   -21.93705
           MN  |  -200.5684   91.31002    -2.20   0.028    -379.5329     -21.604
           MO  |  -164.2766   91.29208    -1.80   0.072    -343.2059    14.65272
           MP  |  -255.7923   99.96189    -2.56   0.011    -451.7141   -59.87043
           MS  |  -174.5737   91.30122    -1.91   0.056    -353.5209    4.373541
           MT  |   -197.481   91.36792    -2.16   0.031     -376.559   -18.40307
           NC  |  -128.2184   91.28949    -1.40   0.160    -307.1426    50.70581
           ND  |  -188.6095   91.36378    -2.06   0.039    -367.6793   -9.539665
           NE  |  -198.2863   91.31884    -2.17   0.030    -377.2681   -19.30458
           NH  |  -109.3058    91.3913    -1.20   0.232    -288.4296    69.81793
           NJ  |  -117.9504   91.31768    -1.29   0.196    -296.9298    61.02909
           NM  |  -180.3089   91.33659    -1.97   0.048    -359.3254   -1.292343
           NV  |  -132.4477   91.34798    -1.45   0.147    -311.4866    46.59115
           NY  |  -135.6922   91.30139    -1.49   0.137    -314.6397    43.25535
           OH  |  -186.5206    91.2909    -2.04   0.041    -365.4476   -7.593647
           OK  |  -193.6169   91.30091    -2.12   0.034    -372.5635    -14.6703
           OR  |  -152.6805   91.32788    -1.67   0.095      -331.68     26.3189
           PA  |  -166.8568   91.29485    -1.83   0.068    -345.7916    12.07788
           PR  |  -400.6855    91.3664    -4.39   0.000    -579.7605   -221.6106
           RI  |  -214.0813   91.33281    -2.34   0.019    -393.0904   -35.07216
           SC  |  -105.8621   91.31304    -1.16   0.246    -284.8324     73.1083
           SD  |  -171.5957   91.40221    -1.88   0.060    -350.7408    7.549483
           TN  |  -138.0173   91.29142    -1.51   0.131    -316.9453    40.91066
           TX  |   -102.198   91.28878    -1.12   0.263    -281.1208     76.7248
           UT  |  -173.6628   91.34342    -1.90   0.057    -352.6928    5.367069
           VA  |  -157.6394   91.29097    -1.73   0.084    -336.5665    21.28773
           VI  |  -220.9272   92.02778    -2.40   0.016    -401.2984   -40.55596
           VT  |  -134.7083   91.55419    -1.47   0.141    -314.1513    44.73476
           WA  |  -177.2222   91.30474    -1.94   0.052    -356.1763    1.731926
           WI  |  -22.12338   91.36111    -0.24   0.809     -201.188    156.9412
           WV  |  -188.8063   91.30802    -2.07   0.039    -367.7668   -9.845768
           WY  |  -180.5778   91.47608    -1.97   0.048    -359.8677   -1.287863
               |
          year |
         2013  |   16.52052   .7469842    22.12   0.000     15.05646    17.98458
         2014  |    30.8379   .7596622    40.59   0.000     29.34899    32.32682
               |
         _cons |   395.2471   91.57581     4.32   0.000     215.7617    574.7325
--------------------------------------------------------------------------------
(est2 stored)

. 
. gen avg_med_medicare_payment_amt = total_med_medicare_payment_amt / total_servi
> ces
(299,903 missing values generated)

. label variable avg_med_medicare_payment_amt "Average medical Medicare payment a
> mount"

. 
. eststo: reg avg_med_medicare_payment_amt total_services total_unique_benes bene
> ficiary_average_age beneficiary_female_count beneficiary_average_risk_score i.n
> ppes_entity_code i.nppes_provider_gender i.nppes_provider_state i.year, r
note: 1.nppes_entity_code omitted because of collinearity

Linear regression                               Number of obs     =  2,135,045
                                                F(66, 2134978)    =    1514.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1080
                                                Root MSE          =     52.128

--------------------------------------------------------------------------------
               |               Robust
avg_med_~t_amt |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
total_services |  -.0005558   .0000357   -15.59   0.000    -.0006257   -.0004859
total_unique~s |  -.0057928    .001804    -3.21   0.001    -.0093286   -.0022569
beneficiary~ge |   .1660769   .0225611     7.36   0.000     .1218578    .2102959
be~emale_count |  -.0105305   .0017849    -5.90   0.000    -.0140287   -.0070322
beneficiary~re |    18.4139   .1138889   161.68   0.000     18.19068    18.63712
               |
nppes_entity~e |
            I  |          0  (omitted)
               |
nppes_provid~r |
            M  |   13.33799   .2681025    49.75   0.000     12.81251    13.86346
               |
nppes_provid~e |
           AE  |  -19.87576   14.33593    -1.39   0.166    -47.97368     8.22215
           AK  |   1.602527    14.0021     0.11   0.909     -25.8411    29.04615
           AL  |  -23.01224   13.95128    -1.65   0.099    -50.35627     4.33178
           AP  |   8.860165   16.20361     0.55   0.585    -22.89835    40.61868
           AR  |  -20.31501   13.95435    -1.46   0.145    -47.66506    7.035038
           AS  |  -61.85657   22.81406    -2.71   0.007    -106.5713   -17.14181
           AZ  |  -17.45796   13.95356    -1.25   0.211    -44.80644     9.89052
           CA  |  -14.47184   13.95235    -1.04   0.300    -41.81795    12.87427
           CO  |   -15.3422   13.95533    -1.10   0.272    -42.69417    12.00976
           CT  |  -19.75245   13.95413    -1.42   0.157    -47.10205    7.597158
           DC  |  -6.697899   13.97544    -0.48   0.632    -34.08927    20.69347
           DE  |  -20.07156   13.95787    -1.44   0.150    -47.42849    7.285375
           FL  |  -12.62071   13.95032    -0.90   0.366    -39.96286    14.72143
           GA  |  -21.59768   13.95105    -1.55   0.122    -48.94125     5.74589
           GU  |  -29.32613   14.11088    -2.08   0.038    -56.98296   -1.669309
           HI  |  -19.46768   13.96691    -1.39   0.163    -46.84234    7.906989
           IA  |  -26.98062   13.95383    -1.93   0.053    -54.32964    .3683907
           ID  |  -19.38417   13.96575    -1.39   0.165    -46.75655    7.988205
           IL  |  -18.15164   13.95126    -1.30   0.193    -45.49562    9.192339
           IN  |  -23.41802   13.95125    -1.68   0.093    -50.76198    3.925945
           KS  |   -22.4729   13.95402    -1.61   0.107    -49.82229    4.876494
           KY  |  -24.99612   13.95165    -1.79   0.073    -52.34086    2.348618
           LA  |  -22.52178   13.95339    -1.61   0.107    -49.86995    4.826382
           MA  |  -18.03468   13.95194    -1.29   0.196    -45.37999    9.310642
           MD  |  -11.90038   13.95278    -0.85   0.394    -39.24735    15.44659
           ME  |  -22.61055   13.95598    -1.62   0.105    -49.96379    4.742683
           MI  |  -21.76858   13.95172    -1.56   0.119    -49.11347    5.576317
           MN  |  -25.81391   13.95514    -1.85   0.064     -53.1655    1.537683
           MO  |  -18.87866   13.95204    -1.35   0.176    -46.22418    8.466865
           MP  |  -34.95839   14.56799    -2.40   0.016    -63.51113   -6.405641
           MS  |  -25.68538   13.95258    -1.84   0.066    -53.03194    1.661191
           MT  |  -18.56822   13.96845    -1.33   0.184     -45.9459    8.809455
           NC  |  -23.10975   13.95041    -1.66   0.098    -50.45208    4.232569
           ND  |  -23.47455   13.96413    -1.68   0.093    -50.84375    3.894657
           NE  |  -26.41651   13.95651    -1.89   0.058    -53.77078    .9377686
           NH  |   -16.5091   13.95744    -1.18   0.237     -43.8652      10.847
           NJ  |  -18.69208   13.95169    -1.34   0.180     -46.0369    8.652743
           NM  |  -21.65387   13.95834    -1.55   0.121    -49.01173    5.703988
           NV  |  -15.14441   13.95692    -1.09   0.278    -42.49948    12.21067
           NY  |  -18.57686   13.95274    -1.33   0.183    -45.92373    8.770023
           OH  |  -22.41736    13.9518    -1.61   0.108     -49.7624    4.927687
           OK  |  -23.09378   13.95325    -1.66   0.098    -50.44167    4.254113
           OR  |     -18.87   13.95788    -1.35   0.176    -46.22696    8.486969
           PA  |  -21.18142   13.95252    -1.52   0.129    -48.52788     6.16503
           PR  |  -36.91814   13.96723    -2.64   0.008    -64.29342   -9.542863
           RI  |  -19.07107   13.95883    -1.37   0.172    -46.42989     8.28776
           SC  |  -23.73408   13.95119    -1.70   0.089    -51.07792     3.60976
           SD  |  -25.69779   13.96147    -1.84   0.066    -53.06178    1.666194
           TN  |  -23.38517   13.95113    -1.68   0.094     -50.7289    3.958564
           TX  |  -19.35862   13.95097    -1.39   0.165    -46.70203    7.984798
           UT  |   -16.3085   13.96272    -1.17   0.243    -43.67494    11.05794
           VA  |  -20.25441   13.95096    -1.45   0.147     -47.5978    7.088993
           VI  |  -17.10839   14.09759    -1.21   0.225    -44.73917    10.52239
           VT  |  -22.25838   13.96927    -1.59   0.111    -49.63766    5.120908
           WA  |  -18.45321   13.95487    -1.32   0.186    -45.80427    8.897843
           WI  |  -27.20371   13.95386    -1.95   0.051    -54.55279    .1453554
           WV  |  -23.64399   13.95372    -1.69   0.090    -50.99279    3.704805
           WY  |  -21.86306   13.97577    -1.56   0.118    -49.25508    5.528954
               |
          year |
         2013  |   .0677965   .0879104     0.77   0.441    -.1045048    .2400978
         2014  |   1.954666   .0882877    22.14   0.000     1.781625    2.127707
               |
         _cons |   43.48956   14.00334     3.11   0.002     16.04349    70.93562
--------------------------------------------------------------------------------
(est3 stored)

. 
. estwide using RichardOuyang_aggregatemed.tex, se nocons star label title("Avera
> ge Cost per Medical Service over Time, by Provider\label{table:aggregatemed}") 
> booktabs replace keep(*.year) b(a3) nonotes
(output written to RichardOuyang_aggregatemed.tex)

. 
. ***** END AGGREGATE *****

. 
. clear

. use aggregate

